import React, { memo } from 'react';

const OperationSetting: React.FC = () => {
  return (
    <div>
      В ближайшее время здесь будут настройки операции. <br />
      Очень скоро. <br />
      А пока что, здесь вот это :) <br />
      <hr />
      <span style={{ display: 'inline-block', width: 'min-content' }}>
        {`
          ░░░ГУСЬ░░░РАБОТЯГА░░░░░░░░░
          ░░░░░▄▀▀▀▄░░░░░░░░░░░░░░░░
          ▄▄██▀░◐░░░▌░░░░░░░░░░░░░░░
          ░░░░▌░░░░░▐░░░░░░░░░░░░░░░
          ░░░░▐░░░░░▐░░░░░░░░░░░░░░░
          ░░░░▌░░░░░▐▄▄░░░░░░░░░░░░░
          ░░░░▌░░░░▄▀▒▒▀▀▀▀▄░░░░░░░░
          ░░░▐░░░░▐▒▒▒▒▒▒▒▒▀▀▄░░░░░░
          ░░░▐░░░░▐▄▒▒▒▒▒▒▒▒▒▒▀▄░░░░
          ░░░░▀▄░░░░▀▄▒▒▒▒▒▒▒▒▒▒▀▄░░
          ░░░░░░▀▄▄▄▄▄█▄▄▄▄▄▄▄▄▄▄▄▀▄
          ░░░░░░░░░░░▌▌▌▌░░░░░░░░░░░
          ░░░░░░░░░░░▌▌░▌▌░░░░░░░░░░
          ░░░░░░░░░▄▄▌▌▄▌▌░░░░░░░░░░
      `}
      </span>
    </div>
  );
};

export default memo(OperationSetting);
